# 3. Написать функцию, аргументы имена сотрудников, 
# возвращает словарь, 
# ключи — первые буквы имён, значения — списки, 
# содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 
# 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


def name_list(*args):
    names_dict = {}
    for i in sorted(args):
        res = i[0]
        if letr not in names_dict:
            names_dict[res] = [i]
        else:
            names_dict[res] +=[i]

    return names_dict

print(name_list("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))
