# 1. Напишите программу, которая принимает на вход
# вещественное число и показывает сумму его цифр.
# Без работы с методами строк.
# in -> out
# - 6782 -> 23
# - 0.67 -> 13
# - 198.45 -> 27

def GetSum():
    num = float(input('Введите вещественное число: '))
    new_num = (len(num)) 
    num * 10 ** new_num
    
    
    # (num % 10) == 0:
    #     new_num = int(num[0] + num[i])
    #     i =+ 1
    # print(new_num)
    # return

GetSum()
 

