# Напишите программу, удаляющую из текста все слова, 
# содержащие "абв". 
# В тексте используется разделитель пробел.

def f(count, word ='абв'):
    f_list = list(f for i in range(count))
    return f_list

print(f)